## Creating Pandas Series

#### Import de bibliotecas

In [19]:
import pandas as pd
import numpy as np

In [2]:
summer = pd.read_csv('../Course_Materials_Part1/Video_Lecture_NBs/summer.csv')

In [3]:
summer.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [4]:
summer["Athlete"]

0                    HAJOS, Alfred
1                 HERSCHMANN, Otto
2                DRIVAS, Dimitrios
3               MALOKINIS, Ioannis
4               CHASAPIS, Spiridon
                   ...
31160           JANIKOWSKI, Damian
31161    REZAEI, Ghasem Gholamreza
31162               TOTROV, Rustam
31163            ALEKSANYAN, Artur
31164               LIDBERG, Jimmy
Name: Athlete, Length: 31165, dtype: object

In [5]:
summer.Athlete

0                    HAJOS, Alfred
1                 HERSCHMANN, Otto
2                DRIVAS, Dimitrios
3               MALOKINIS, Ioannis
4               CHASAPIS, Spiridon
                   ...
31160           JANIKOWSKI, Damian
31161    REZAEI, Ghasem Gholamreza
31162               TOTROV, Rustam
31163            ALEKSANYAN, Artur
31164               LIDBERG, Jimmy
Name: Athlete, Length: 31165, dtype: object

In [8]:
summer.iloc[0]

Year                    1896
City                  Athens
Sport               Aquatics
Discipline          Swimming
Athlete        HAJOS, Alfred
Country                  HUN
Gender                   Men
Event         100M Freestyle
Medal                   Gold
Name: 0, dtype: object

#### new import from csv

In [14]:
summer = pd.read_csv("../Course_Materials_Part1/Video_Lecture_NBs/summer.csv", 
                     usecols = ["Athlete"], squeeze=True).head()

In [15]:
summer

0         HAJOS, Alfred
1      HERSCHMANN, Otto
2     DRIVAS, Dimitrios
3    MALOKINIS, Ioannis
4    CHASAPIS, Spiridon
Name: Athlete, dtype: object

### Creating from scratch with pd.Series()

In [16]:
pd.Series([10, 25, 6, 36, 8])

0    10
1    25
2     6
3    36
4     8
dtype: int64

In [17]:
pd.Series([10, 25, 6, 36, 8], index = ["Mon", "Tue", "Wed", "Thu", "Fri"])

Mon    10
Tue    25
Wed     6
Thu    36
Fri     8
dtype: int64

In [18]:
pd.Series([10, 25, 6, 36, 8], index = ["Mon", "Tue", "Wed", "Thu", "Fri"], name= "Sales")

Mon    10
Tue    25
Wed     6
Thu    36
Fri     8
Name: Sales, dtype: int64

### Creating Panda Series with numpy

In [20]:
sales = np.array([5, 6, 8, 12, 3])

In [21]:
sales

array([ 5,  6,  8, 12,  3])

In [22]:
pd.Series(sales)

0     5
1     6
2     8
3    12
4     3
dtype: int64

In [23]:
vendas = [5, 9, 7, 5, 4]

In [24]:
pd.Series(sales)

0     5
1     6
2     8
3    12
4     3
dtype: int64

#### From dictionary

In [25]:
dic = {"Mon": 10, "Tue": 2, "Wed": 5, "Thu": 3, "Fri": 8}

In [26]:
sales = pd.Series(dic)

In [27]:
sales

Mon    10
Tue     2
Wed     5
Thu     3
Fri     8
dtype: int64

In [28]:
pd.Series(dic, index=[1,2,3,4,5])

1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
dtype: float64

### Indexing and Slicing Series

In [29]:
titanic = pd.read_csv('../Course_Materials_Part1/Video_Lecture_NBs/titanic.csv')

In [30]:
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [31]:
age = titanic.age

In [32]:
age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [33]:
age.tail()

886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, dtype: float64

In [34]:
age.index

RangeIndex(start=0, stop=891, step=1)

In [35]:
age[0]

22.0

In [36]:
age[2]

26.0

In [37]:
age.iloc[-1]

32.0

In [39]:
# age[-1] doesn work

In [40]:
age[890]

32.0

In [48]:
age.iloc[[3,4]]

3    35.0
4    35.0
Name: age, dtype: float64

In [50]:
age.iloc[:8] # best practice uses iloc to index and slicing panda series

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
Name: age, dtype: float64

In [51]:
age[5:9]

5     NaN
6    54.0
7     2.0
8    27.0
Name: age, dtype: float64

In [52]:
summer = pd.read_csv("../Course_Materials_Part1/Video_Lecture_NBs/summer.csv", 
                     index_col = ["Athlete"])

In [53]:
summer.head()

,Year,City,Sport,Discipline,Country,Gender,Event,Medal
Athlete,,,,,,,,
"HAJOS, Alfred",1896,Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
"HERSCHMANN, Otto",1896,Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver
"DRIVAS, Dimitrios",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Bronze
"MALOKINIS, Ioannis",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Gold
"CHASAPIS, Spiridon",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Silver

In [55]:
event = summer.Event

In [56]:
event.head()

Athlete
HAJOS, Alfred                     100M Freestyle
HERSCHMANN, Otto                  100M Freestyle
DRIVAS, Dimitrios     100M Freestyle For Sailors
MALOKINIS, Ioannis    100M Freestyle For Sailors
CHASAPIS, Spiridon    100M Freestyle For Sailors
Name: Event, dtype: object

In [57]:
event[0]

'100M Freestyle'

In [58]:
event.iloc[0]

'100M Freestyle'

In [59]:
event.loc['CHASAPIS, Spiridon']

'100M Freestyle For Sailors'

In [61]:
event.iloc[:3]

Athlete
HAJOS, Alfred                    100M Freestyle
HERSCHMANN, Otto                 100M Freestyle
DRIVAS, Dimitrios    100M Freestyle For Sailors
Name: Event, dtype: object

In [62]:
event.loc[:"DRIVAS, Dimitrios"]

Athlete
HAJOS, Alfred                    100M Freestyle
HERSCHMANN, Otto                 100M Freestyle
DRIVAS, Dimitrios    100M Freestyle For Sailors
Name: Event, dtype: object

### Sorting and introduction to the inplace-parameter

In [64]:
dic = {1:10, 3:25, 2:6, 4: 36, 5:2, 6:0, 7:None}
dic

{1: 10, 3: 25, 2: 6, 4: 36, 5: 2, 6: 0, 7: None}

In [66]:
sales = pd.Series(dic)
sales

1    10.0
3    25.0
2     6.0
4    36.0
5     2.0
6     0.0
7     NaN
dtype: float64

In [67]:
sales.sort_index()

1    10.0
2     6.0
3    25.0
4    36.0
5     2.0
6     0.0
7     NaN
dtype: float64

In [73]:
sales.sort_index(ascending=False)

7     NaN
6     0.0
5     2.0
4    36.0
3    25.0
2     6.0
1    10.0
dtype: float64

In [77]:
sales.sort_values(inplace=False)

6     0.0
5     2.0
2     6.0
1    10.0
3    25.0
4    36.0
7     NaN
dtype: float64

In [80]:
sales.sort_values(ascending=False, inplace=False, na_position="last")

4    36.0
3    25.0
1    10.0
2     6.0
5     2.0
6     0.0
7     NaN
dtype: float64

In [82]:
dic = {"Mon": 10, "Tue": 25, "Wed": 6, "Thu": 36, "Fri": 2}
dic

{'Mon': 10, 'Tue': 25, 'Wed': 6, 'Thu': 36, 'Fri': 2}

In [84]:
sales = pd.Series(dic)

In [86]:
sales

Mon    10
Tue    25
Wed     6
Thu    36
Fri     2
dtype: int64

In [87]:
sales.sort_index(ascending=True)

Fri     2
Mon    10
Thu    36
Tue    25
Wed     6
dtype: int64

### nlargest() and nsmallest()

In [89]:
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [90]:
age = titanic.age

In [91]:
age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [92]:
age.nlargest()

630    80.0
851    74.0
96     71.0
493    71.0
116    70.5
Name: age, dtype: float64

In [94]:
age.nsmallest()

803    0.42
755    0.67
469    0.75
644    0.75
78     0.83
Name: age, dtype: float64

In [97]:
age.nsmallest().index

Int64Index([803, 755, 469, 644, 78], dtype='int64')

In [101]:
age.sort_values(ascending=True).head(3)

803    0.42
755    0.67
644    0.75
Name: age, dtype: float64

In [102]:
age.nlargest(3)

630    80.0
851    74.0
96     71.0
Name: age, dtype: float64

In [103]:
age.nsmallest().iloc[:3]

803    0.42
755    0.67
469    0.75
Name: age, dtype: float64

### idxmin and idxmax()

In [104]:
titanic.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN

#### index of the greatest value

In [107]:
titanic.age.idxmax()

630

#### index of the smallest value

In [108]:
titanic.age.idxmin()

803

In [109]:
titanic.iloc[630]

survived       1
pclass         1
sex         male
age         80.0
sibsp          0
parch          0
fare        30.0
embarked       S
deck           A
Name: 630, dtype: object

In [110]:
titanic.iloc[titanic.age.idxmax]

survived       1
pclass         1
sex         male
age         80.0
sibsp          0
parch          0
fare        30.0
embarked       S
deck           A
Name: 630, dtype: object